Lesson 1

In [77]:
import pandas as pd
import numpy as np

In [6]:
authors = pd.DataFrame({"author_id":[1, 2, 3], "author_name":["Тургенев", "Чехов", "Островский"]}, columns = ["author_id", "author_name"])

In [9]:
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [10]:
book = pd.DataFrame({"author_id":[1, 1, 1, 2, 2, 3, 3], "book_title":['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'], "price":[450, 300, 350, 500, 450, 370, 290]})

In [11]:
book

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

Lesson 2

In [15]:
authors_price = pd.merge(authors, book, on = "author_id")

In [16]:
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

Lesson 3

In [17]:
top5 = authors_price.nlargest(5, "price")

In [18]:
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

Lesson 4

In [68]:
author_stats = pd.concat([authors_price.groupby("author_name").agg({"price":"max"}).rename(columns = {"price":"max_price"}), authors_price.groupby("author_name").agg({"price":"min"}).rename(columns = {"price":"min_price"}), authors_price.groupby("author_name").agg({"price":"mean"}).rename(columns = {"price":"mean_price"})], axis = 1)
author_stats

             max_price  min_price  mean_price
author_name
Островский         370        290  330.000000
Тургенев           450        300  366.666667
Чехов              500        450  475.000000

Lesson 5

In [71]:
df1 = pd.DataFrame({'cover':['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']}, columns=['cover']) 
authors_price = pd.concat([authors_price, df1], axis = 1)
authors_price

   author_id author_name            book_title  price    cover
0          1    Тургенев           Отцы и дети    450  твердая
1          1    Тургенев                 Рудин    300   мягкая
2          1    Тургенев     Дворянское гнездо    350   мягкая
3          2       Чехов      Толстый и тонкий    500  твердая
4          2       Чехов       Дама с собачкой    450  твердая
5          3  Островский                 Гроза    370   мягкая
6          3  Островский  Таланты и поклонники    290   мягкая

In [72]:
?pd.pivot_table

In [80]:
book_info = pd.pivot_table(authors_price, values = 'price', index = ['author_name'],columns = ['cover'], aggfunc = np.sum, fill_value = 0)
book_info

cover        мягкая  твердая
author_name
Островский      660        0
Тургенев        650      450
Чехов             0      950

In [84]:
book_info.to_pickle('book_info.pkl')

In [85]:
book_info2 = pd.read_pickle('book_info.pkl')

In [86]:
book_info==book_info2

cover        мягкая  твердая
author_name
Островский     True     True
Тургенев       True     True
Чехов          True     True